# Volatility
#
# Authors:
#   Fred House (fred.house@mandiant.com) - Mandiant, a FireEye Company
#   Andrew Davis (andrew.davis@mandiant.com) - Mandiant, a FireEye Company
#   Claudiu Teodorescu (claudiu.teodorescu@fireeye.com) - FireEye Inc.
#
# This file is part of Volatility.
#
# Volatility is free software; you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation; either version 2 of the License, or
# (at your option) any later version.
#
# Volatility is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with Volatility.  If not, see <http://www.gnu.org/licenses/>.
#
import binascii
import datetime
import volatility.debug as debug
import volatility.exceptions as exceptions
import volatility.obj as obj
import volatility.plugins.common as common
import volatility.plugins.taskmods as taskmods
import volatility.utils as utils
import volatility.win32.modules as modules  
import volatility.win32.tasks as tasks  

###############################################################################
# Data Structures
###############################################################################

#######################################
# Windows XP (x86)
#######################################
shimcache_xp_x86 = {

    'SHIM_CACHE_HEADER' : [ 0x190, {
        'Magic' : [0x0, ['unsigned int']],
        'Unknown' : [0x4, ['unsigned int']],
        'NumEntries' : [0x8, ['unsigned int']],
        'Unknown' : [0xc, ['unsigned int']],
    } ],

    'SHIM_CACHE_ENTRY' : [ 0x228, {
        'Path' : [ 0x0, ['NullString', dict(length = 0x208, encoding = 'utf8')]],
        'LastModified' : [ 0x210, ['WinTimeStamp', dict(is_utc = True)]],
        'FileSize': [0x218, ['long long']],
        'LastUpdate' : [ 0x220, ['WinTimeStamp', dict(is_utc = True)]],
    } ],
}

shimcache_xp_sp2_x86 = {
    #redefine for consistency with XP SP3 definition below
    '_SEGMENT' : [ 0x40, {
      'ControlArea' : [ 0x0, ['pointer', ['_CONTROL_AREA']]],
      'TotalNumberOfPtes' : [ 0x4, ['unsigned long']],
      'NonExtendedPtes' : [ 0x8, ['unsigned long']],
      'WritableUserReferences' : [ 0xc, ['unsigned long']],
      'SizeOfSegment' : [ 0x10, ['unsigned long long']],
      'SegmentPteTemplate' : [ 0x18, ['_MMPTE']],
      'NumberOfCommittedPages' : [ 0x1c, ['unsigned long']],
      'ExtendInfo' : [ 0x20, ['pointer', ['_MMEXTEND_INFO']]],
      'SystemImageBase' : [ 0x24, ['pointer', ['void']]],
      'BasedAddress' : [ 0x28, ['pointer', ['void']]],
      'u1' : [ 0x2c, ['pointer', ['void']]],
      'u2' : [ 0x30, ['pointer', ['void']]],
      'PrototypePte' : [ 0x34, ['pointer', ['_MMPTE']]],
      'ThePtes' : [ 0x3c, ['array', 1, ['_MMPTE']]],
    } ],     
}

shimcache_xp_sp3_x86 = {
    #redefine as the sizes of SegmentPteTemplate and PrototypePte are incorrect
    # in the XP overlay (should be 8 bytes, not 4)
    '_SEGMENT' : [ 0x48, {
      'ControlArea' : [ 0x0, ['pointer', ['_CONTROL_AREA']]],
      'TotalNumberOfPtes' : [ 0x4, ['unsigned long']],
      'NonExtendedPtes' : [ 0x8, ['unsigned long']],
      'WritableUserReferences' : [ 0xc, ['unsigned long']],
      'SizeOfSegment' : [ 0x10, ['unsigned long long']],
      'SegmentPteTemplate' : [ 0x18, ['_MMPTE']],
      'NumberOfCommittedPages' : [ 0x20, ['unsigned long']],
      'ExtendInfo' : [ 0x24, ['pointer', ['_MMEXTEND_INFO']]],
      'SystemImageBase' : [ 0x28, ['pointer', ['void']]],
      'BasedAddress' : [ 0x2c, ['pointer', ['void']]],
      'u1' : [ 0x30, ['pointer', ['void']]],
      'u2' : [ 0x34, ['pointer', ['void']]],
      'PrototypePte' : [ 0x38, ['pointer', ['_MMPTE']]],
      'ThePtes' : [ 0x40, ['array', 1, ['_MMPTE']]],
    } ],
}

#######################################
# Windows Server 2003 (x86/x64)
#######################################
shimcache_2003_x86 = {
    'SHIM_CACHE_ENTRY' : [ None, {
        'ListEntry' : [0x0, ['_LIST_ENTRY']],
        'Path' : [ 0x8, ['_UNICODE_STRING']],
        'LastModified' : [0x10, ['WinTimeStamp', dict(is_utc = True)]],
        'FileSize': [0x18, ['unsigned long']],
        'Padding': [0x20, ['unsigned long']],
    } ],
}

shimcache_2003_x64 = {
    'SHIM_CACHE_ENTRY' : [ 0x30, {
        'ListEntry' : [0x0, ['_LIST_ENTRY']],
        'Path' : [ 0x10, ['_UNICODE_STRING']],
        'LastModified' : [0x20, ['WinTimeStamp', dict(is_utc = True)]],
        'FileSize' : [0x28, ['unsigned long long']],
    } ],
}

#######################################
# Windows Vista (x86/x64)
# Windows Server 2008 (x86/x64)
#######################################
shimcache_vista_x86 = {
    'SHIM_CACHE_ENTRY' : [ 0x20, {
        'ListEntry' : [0x0, ['_LIST_ENTRY']],
        'Path' : [ 0x8, ['_UNICODE_STRING']],
        'LastModified' : [0x10, ['WinTimeStamp', dict(is_utc = True)]],
        'InsertFlags' : [0x18, ['unsigned int']],
        'ShimFlags' : [0x1c, ['unsigned int']],
    } ],
}

shimcache_vista_x64 = {
    'SHIM_CACHE_ENTRY' : [ 0x30, {
        'ListEntry' : [0x0, ['_LIST_ENTRY']],
        'Path' : [ 0x10, ['_UNICODE_STRING']],
        'LastModified' : [0x20, ['WinTimeStamp', dict(is_utc = True)]],
        'InsertFlags' : [0x28, ['unsigned int']],
        'ShimFlags' : [0x2c, ['unsigned int']],
    } ],
}

#######################################
# Windows 7 (x86/x64) 
# Windows Server 2008 R2 (x86/x64)
#######################################
shimcache_win7_x86 = {
    'SHIM_CACHE_ENTRY' : [ None, {
        'ListEntry' : [0x0, ['_LIST_ENTRY']],
        'Path' : [ 0x08, ['_UNICODE_STRING']],
        'LastModified' : [0x10, ['WinTimeStamp', dict(is_utc = True)]],
        'InsertFlags' : [0x18, ['unsigned int']],
        'ShimFlags' : [0x1c, ['unsigned int']],
        'BlobSize' : [0x20, ['unsigned int']],
        'BlobBuffer' : [0x24, ['unsigned long']],
    } ],
}

shimcache_win7_x64 = {
    'SHIM_CACHE_ENTRY' : [ None, {
        'ListEntry' : [0x0, ['_LIST_ENTRY']],
        'Path' : [ 0x10, ['_UNICODE_STRING']],
        'LastModified' : [0x20, ['WinTimeStamp', dict(is_utc = True)]],
        'InsertFlags' : [0x28, ['unsigned int']],
        'ShimFlags' : [0x2c, ['unsigned int']],
        'BlobSize' : [0x30, ['unsigned long long']],
        'BlobBuffer' : [0x38, ['unsigned long long']],
    } ],
}

#######################################
# Windows 8 (x86/x64)
# Windows 8.1 (x86/x64)
# Windows Server 2012 (x86/x64)
# Windows Server 2012 R2 (x86/x64)
#######################################
shimcache_win8_x86 = {
    'SHIM_CACHE_ENTRY' : [ None, {
        'ListEntry' : [0x0, ['_LIST_ENTRY']],
        'Unknown1' : [ 0x8, ['unsigned long']],
        'Unknown2' : [ 0xc, ['unsigned long']],
        'Path' : [ 0x10, ['_UNICODE_STRING']],
        'Unknown3' : [ 0x18, ['unsigned long long']],
        'ListEntryDetail' : [ 0x20, ['pointer', ['SHIM_CACHE_ENTRY_DETAIL']]],
    } ],
}

shimcache_win8_x86_detail = {
    'SHIM_CACHE_ENTRY_DETAIL' : [ None, {
        'LastModified' : [0x0, ['WinTimeStamp', dict(is_utc = True)]],
        'InsertFlags' : [0x08, ['unsigned int']],
        'ShimFlags' : [0x0c, ['unsigned int']],
        'BlobSize' : [0x10, ['unsigned long']],
        'BlobBuffer' : [0x14, ['unsigned long']],
    } ],
}

shimcache_win8_x64 = {
    'SHIM_CACHE_ENTRY' : [ None, {
        'ListEntry' : [0x0, ['_LIST_ENTRY']],
        'Unknown1' : [ 0x10, ['unsigned long long']],
        'Path' : [ 0x18, ['_UNICODE_STRING']],
        'Unknown2' : [ 0x28, ['unsigned long long']],
        'Unknown3' : [ 0x30, ['unsigned long long']],
        'ListEntryDetail' : [ 0x38, ['pointer', ['SHIM_CACHE_ENTRY_DETAIL']]],
    } ],
}

shimcache_win8_x64_detail = {
    'SHIM_CACHE_ENTRY_DETAIL' : [ None, {
        'LastModified' : [0x0, ['WinTimeStamp', dict(is_utc = True)]],
        'InsertFlags' : [0x08, ['unsigned int']],
        'ShimFlags' : [0x0c, ['unsigned int']],
        'BlobSize' : [0x10, ['unsigned long long']],
        'Padding' : [0x18, ['unsigned long long']],
        'BlobBuffer' : [0x20, ['unsigned long long']],
    } ],
}

shimcache_objs_x86 = {
    # explicitly define _RTL_BALANCED_LINKS and _RTL_AVL_TABLE as they are not
    # present in all OS platform overlays (e.g., 2003 x64)
    '_RTL_BALANCED_LINKS' : [ 0x10, {
        'Parent' : [ 0x0, ['pointer', ['_RTL_BALANCED_LINKS']]],
        'LeftChild' : [ 0x4, ['pointer', ['_RTL_BALANCED_LINKS']]],
        'RightChild' : [ 0x8, ['pointer', ['_RTL_BALANCED_LINKS']]],
        'Balance' : [ 0xc, ['unsigned char']],
        'Reserved' : [ 0xd, ['array', 3, ['unsigned char']]],
    } ],
    '_RTL_AVL_TABLE' : [ 0x38, {
        'BalancedRoot' : [ 0x0, ['_RTL_BALANCED_LINKS']],
        'OrderedPointer' : [ 0x10, ['pointer', ['void']]],
        'WhichOrderedElement' : [ 0x14, ['unsigned long']],
        'NumberGenericTableElements' : [ 0x18, ['unsigned long']],
        'DepthOfTree' : [ 0x1c, ['unsigned long']],
        'RestartKey' : [ 0x20, ['pointer', ['_RTL_BALANCED_LINKS']]],
        'DeleteCount' : [ 0x24, ['unsigned long']],
        'CompareRoutine' : [ 0x28, ['pointer', ['void']]],
        'AllocateRoutine' : [ 0x2c, ['pointer', ['void']]],
        'FreeRoutine' : [ 0x30, ['pointer', ['void']]],
        'TableContext' : [ 0x34, ['pointer', ['void']]],
    } ],
    # define shim cache handle objects found on Windows 8.x platforms.
    'SHIM_CACHE_HANDLE' : [ 0x8, {
        'eresource' : [ 0x0, ['pointer', ['_ERESOURCE']]],
        'rtl_avl_table' : [ 0x4, ['pointer', ['_RTL_AVL_TABLE']]],
    } ],
}

shimcache_objs_x64 = {
    '_RTL_BALANCED_LINKS' : [ 0x20, {
      'Parent' : [ 0x0, ['pointer64', ['_RTL_BALANCED_LINKS']]],
      'LeftChild' : [ 0x8, ['pointer64', ['_RTL_BALANCED_LINKS']]],
      'RightChild' : [ 0x10, ['pointer64', ['_RTL_BALANCED_LINKS']]],
      'Balance' : [ 0x18, ['unsigned char']],
      'Reserved' : [ 0x19, ['array', 3, ['unsigned char']]],
    } ],
    '_RTL_AVL_TABLE' : [ 0x68, {
      'BalancedRoot' : [ 0x0, ['_RTL_BALANCED_LINKS']],
      'OrderedPointer' : [ 0x20, ['pointer64', ['void']]],
      'WhichOrderedElement' : [ 0x28, ['unsigned long']],
      'NumberGenericTableElements' : [ 0x2c, ['unsigned long']],
      'DepthOfTree' : [ 0x30, ['unsigned long']],
      'RestartKey' : [ 0x38, ['pointer64', ['_RTL_BALANCED_LINKS']]],
      'DeleteCount' : [ 0x40, ['unsigned long']],
      'CompareRoutine' : [ 0x48, ['pointer64', ['void']]],
      'AllocateRoutine' : [ 0x50, ['pointer64', ['void']]],
      'FreeRoutine' : [ 0x58, ['pointer64', ['void']]],
      'TableContext' : [ 0x60, ['pointer64', ['void']]],
    } ],
    'SHIM_CACHE_HANDLE' : [ 0x10, {
      'eresource' : [ 0x0, ['pointer', ['_ERESOURCE']]],
      'rtl_avl_table' : [ 0x8, ['pointer', ['_RTL_AVL_TABLE']]],
    } ],
}

###############################################################################
# Complex Object Definitions
###############################################################################
class ShimCacheEntry(obj.CType):
    """An entry in the Shimcache LRU list. This complext object abstract the
       variations in the LRU list entry structure"""

    def get_file_size(self):
        """Return the file size if available, otherwise None"""
        if hasattr(self, 'FileSize') and self.FileSize >= 0:
            return self.FileSize
        else:
            return None

    def get_last_modified(self):
        """Windows 8 stores the last modified in a ListEntry attribute, 
           where as all other versions store it as an attribute of the 
           ShimCacheEntry object."""
        if hasattr(self, 'ListEntryDetail'):
            return self.ListEntryDetail.LastModified
        else:
            return self.LastModified

    def get_last_update(self):
        """Windows XP provides a LastUpdate attribute"""
        if hasattr(self, 'LastUpdate'):
            return self.LastUpdate
        else:
            return None

    def get_file_path(self, encoding = 'ascii'):
        """Return the shimcache entry file path, stripping any non-utf16
           characters; default encoding is ascii"""

        #the Path attribute has Buffer and Length attributes on every OS except
        #XP, in which case it is a null termined string; return the appropriate
        #path value here
        if not hasattr(self.Path, 'Buffer'):
            return self.Path
                
        file_path = self.obj_vm.read(self.Path.Buffer, self.Path.Length) or ''

        #remove any non-UTF16 characters
        file_path = file_path.decode('utf16', 'ignore')

        #re-encode is specified encoding
        file_path = file_path.encode(encoding, 'ignore')

        return file_path

    def get_exec_flag(self):
        """Checks if InsertFlags fields has been bitwise OR'd with a value of 2.
           This behavior was observed when processes are created by CSRSS."""
        exec_flag = ''
        if hasattr(self, 'ListEntryDetail') and hasattr(self.ListEntryDetail, 'InsertFlags'):
            exec_flag = self.ListEntryDetail.InsertFlags & 0x2 == 2
        elif hasattr(self, 'InsertFlags'):
            exec_flag = self.InsertFlags & 0x2 == 2
        return exec_flag
    
    def __str__(self):
        """String representation of ShimCacheEntry (intended for debugging)"""
      
        blob_off, blob_val = None,None
        try:
            blob_off = self.BlobSize.obj_offset
            blob_val = self.BlobSize.v()
        except AttributeError as e:
            pass

        try:
            last_mod_offset = self.LastModified.obj_offset
        except AttributeError as e:
            last_mod_offset = self.ListEntryDetail.LastModified.obj_offset

        try:
            last_upd_offset = self.LastUpdate.obj_offset
        except AttributeError as e:
            last_upd_offset = None

        if hasattr(self, 'ListEntry'):
            shim_str = "Shimcache Entry at (0x{0:08x})\n".format(self.ListEntry) + \
                       "\tFlink      (0x{0:08x}) = 0x{1:08x}\n".format(self.ListEntry, self.ListEntry.Flink.dereference().obj_offset) + \
                       "\tBlink      (0x{0:08x}) = 0x{1:08x}\n".format(self.ListEntry.obj_offset+self.ListEntry.Flink.size(), self.ListEntry.Blink.dereference().obj_offset) + \
                       "\tPath       (0x{0:08x}) = {1}\n".format(self.Path.obj_offset, self.get_file_path()) + \
                       "\tPath Size  (0x{0:08x}) = {1:d}\n".format(self.Path.Length.obj_offset, self.Path.Length.v()) + \
                       "\tLast Mod   (0x{0:08x}) = {1}\n".format(last_mod_offset, self.get_last_modified())
